[
  {
    "id": "2",
    "arabicText": "ٱلَّذِينَ يُؤْمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ",
    "translationText": "Who believe in the unseen, establish prayer, and spend out of what We have provided for them.",
    "reference": "Al-Baqarah 2:3"
  },
  {
    "id": "285",
    "arabicText": "آمَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلۡيۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَ ۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّنۡ رُّسُلِهِۦ ۚ وَقَالُوا۟ سَمِعۡنَا وَأَطَعۡنَا ۖ غُفۡرَٰنَكَ رَبَّنَا وَإِلَيۡكَ ٱلۡمَصِيرُ",
    "translationText": "The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], 'We make no distinction between any of His messengers.' And they say, 'We hear and we obey. [Grant] Your forgiveness, our Lord. To You is the final destination.'",
    "reference": "Al-Baqarah 2:285"
  },
  {
    "id": "256",
    "arabicText": "لَا إِكْرَاهَ فِي الدِّينِ ۖ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَن يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِن بِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ لَا انفِصَامَ لَهَا ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ",
    "translationText": "There shall be no compulsion in [acceptance of] the religion. The right course has become clear from the wrong. So whoever disbelieves in Taghut and believes in Allah has grasped the most trustworthy handhold with no break in it. And Allah is Hearing and Knowing.",
    "reference": "Al-Baqarah 2:256"
  },
  {
    "id": "6",
    "arabicText": "وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا",
    "translationText": "And whoever relies upon Allah – then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent.",
    "reference": "At-Talaq 65:3"
  },
  {
    "id": "7",
    "arabicText": "إِنَّمَا ٱلْمُؤْمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ ءَايَٰتُهُۥ زَادَتْهُمْ إِيمَٰنًا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
    "translationText": "The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely.",
    "reference": "Al-Anfal 8:2"
  },
  {
    "id": "51",
    "arabicText": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَءَامِنُوا۟ بِرَسُولِهِۦ لَعَلَّكُمْ تُرْحَمُونَ",
    "translationText": "O you who have believed, fear Allah and believe in His Messenger that you may receive mercy.",
    "reference": "Al-Hujurat 49:51"
  }
]
