[
  {
    "id": "2",
    "arabicText": "هُدًى لِّلْمُتَّقِينَ",
    "translationText": "A guidance for the righteous.",
    "reference": "Al-Baqarah 2:2"
  },
  {
    "id": "6",
    "arabicText": "وَهَٰذَا صِرَاطِي مُسْتَقِيمًا فَٱتَّبِعُوهُ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَن سَبِيلِهِۦ ۚ ذَٰلِكُمْ وَصَّىٰكُم بِهِۦ لَعَلَّكُمْ تَتَّقُونَ",
    "translationText": "And this is My path, which is straight, so follow it; and do not follow [other] ways, for you will be separated from His way. This has He instructed you that you may become righteous.",
    "reference": "Al-An'am 6:153"
  },
  {
    "id": "13",
    "arabicText": "وَنَزَّلْنَا عَلَيْكَ الْكِتَابَ تِبْيَانًا لِّكُلِّ شَيْءٍ وَهُدًى وَرَحْمَةً وَبُشْرَىٰ لِلْمُسْلِمِينَ",
    "translationText": "And We have revealed to you the Book as clarification for all things and as guidance and mercy and good tidings for the Muslims.",
    "reference": "An-Nahl 16:89"
  },
  {
    "id": "97",
    "arabicText": "إِنَّ هَٰذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ",
    "translationText": "Indeed, this Qur’an guides to that which is most suitable.",
    "reference": "Al-Isra 17:9"
  },
  {
    "id": "125",
    "arabicText": "فَمَنِ ٱهْتَدَىٰ فَإِنَّمَا يَهْتَدِي لِنَفْسِهِۦ وَمَن ضَلَّ فَقُلْ إِنَّمَآ أَنَا۟ مِنَ ٱلْمُنذِرِينَ",
    "translationText": "So whoever is guided is only guided for [the benefit of] himself; and whoever goes astray only goes astray to his own loss. And you are not a manager over them.",
    "reference": "Al-Isra 17:125"
  },
  {
    "id": "186",
    "arabicText": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌۭ أُجِيبُ دَعْوَةَ ٱلدَّاعِ إِذَا دَعَانِ",
    "translationText": "And when My servants ask you concerning Me, indeed I am near. I respond to the invocation of the supplicant when he calls upon Me.",
    "reference": "Al-Baqarah 2:186"
  },
  {
    "id": "282",
    "arabicText": "وَٱتَّقُوا ٱللَّهَ وَيُعَلِّمُكُمُ ٱللَّهُ ۗ وَٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمٌۭ",
    "translationText": "And fear Allah. And Allah teaches you. And Allah is Knowing of all things.",
    "reference": "Al-Baqarah 2:282"
  }
]
