[
  {
    "id": "286",
    "arabicText": "لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَا ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ",
    "translationText": "Allah does not burden a soul beyond that it can bear. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.",
    "reference": "Al-Baqarah 2:286"
  },
  {
    "id": "5",
    "arabicText": "فَإِنَّ مَعَ ٱلْعُسْرِ يُسْرًا إِنَّ مَعَ ٱلْعُسْرِ يُسْرًا",
    "translationText": "For indeed, with hardship [will be] ease. Indeed, with hardship [will be] ease.",
    "reference": "Ash-Sharh 94:5-6"
  },
  {
    "id": "153",
    "arabicText": "يَا أَيُّهَا الَّذِينَ آمَنُوا ٱصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَٱتَّقُوا ٱللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
    "translationText": "O you who have believed, persevere and endure and remain stationed and fear Allah that you may be successful.",
    "reference": "Aal-E-Imran 3:200"
  },
  {
    "id": "7",
    "arabicText": "وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِنَ ٱلْخَوْفِ وَٱلْجُوعِ وَنَقْصٍ مِّنَ ٱلْأَمْوَالِ وَٱلْأَنفُسِ وَٱلثَّمَرَٰتِ ۗ وَبَشِّرِ ٱلصَّـٰبِرِينَ",
    "translationText": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient.",
    "reference": "Al-Baqarah 2:155"
  },
  {
    "id": "40",
    "arabicText": "أَفَصْلَحَتِ ٱلْقِيَٰمَةُ إِلَّا لِلَّذِينَ ٱتَّقَوْا۟ وَكَانَتْ تَذْكِرَةًۭ لِّلْمُتَّقِينَ",
    "translationText": "Will the Day of Resurrection not be [a cause of] regret for those who have feared [Allah] and were fearing the truth?",
    "reference": "Al-Qiyamah 75:13"
  }
]
