[
  {
    "id": "58",
    "arabicText": "إِنَّ ٱللَّهَ يَأْمُرُكُم أَن تُؤَدُّوا ٱلْأَمَـٰنَـٰتِ إِلَىٰٓ أَهْلِهَا وَإِذَا حَكَمۡتُم بَيۡنَ ٱلنَّاسِ أَن تَحۡكُمُوا۟ بِٱلۡعَدْلِ ۚ إِنَّ ٱللَّهَ نِعِمَّا يَعِظُكُم بِهِۦ ۗ إِنَّ ٱللَّهَ كَانَ سَمِيعٗا بَصِيرٗا",
    "translationText": "Indeed, Allah commands you to render trusts to whom they are due and when you judge between people to judge with justice. Excellent is that which Allah instructs you. Indeed, Allah is ever Hearing and Seeing.",
    "reference": "An-Nisa 4:58"
  },
  {
    "id": "135",
    "arabicText": "يَا أَيُّهَا ٱلَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِٱلۡقِسۡطِ شُهَدَآءَ لِلَّهِ وَلَوۡ عَلَىٰٓ أَنفُسِكُمۡ أَوِ ٱلۡوَٰلِدَيۡنِ وَٱلۡأَقۡرَبِينَ ۚ إِن يَكُنۡ غَنِيّٗا أَوۡ فَقِيرٗا فٱللَّهُ أَوۡلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا ٱلۡهَوَىٰٓ أَن تَعۡدِلُوا۟ ۚ وَإِن تَلۡوُوا۟ أَوۡ تُعۡرِضُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا",
    "translationText": "O you who have believed, be persistently standing firm in justice, witnesses for Allah, even if it be against yourselves or parents and relatives. Whether one is rich or poor, Allah is more worthy of both. So follow not [personal] inclination, lest you not be just. And if you distort [your testimony] or refuse [to give it], then indeed Allah is ever, with what you do, Acquainted.",
    "reference": "An-Nisa 4:135"
  },
  {
    "id": "105",
    "arabicText": "إِنَّ ٱللَّهَ يَأْمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَـٰنِ وَإِيتَآءِ ذِي ٱلۡقُرۡبَىٰ وَيَنۢهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنۢكَرِ وَٱلۡبَغۡيِ ۚ يَعِظُكُم لَعَلَّكُمۡ تَذَكَّرُونَ",
    "translationText": "Indeed, Allah commands justice and the doing of good, and giving to relatives; and forbids immorality, and bad conduct, and oppression. He admonishes you that perhaps you will be reminded.",
    "reference": "An-Nahl 16:90"
  },
  {
    "id": "8",
    "arabicText": "وَٱلَّذِينَ هُم لِّأَمَـٰنَـٰتِهِم وَعَهْدِهِمۡ رَٰعُونَ",
    "translationText": "And those who are to their trusts and promises attentive.",
    "reference": "Al-Mu’minun 23:8"
  },
  {
    "id": "177",
    "arabicText": "وَٱلَّذِينَ يُؤۡتُونَ ٱلَّذِينَ ٱلۡمَسَـٰكِينَ وَٱلۡمَسَـٰفِرِينَ وَلَا يُبۡغُونَ عَلَيۡهِمۡ حِسَابٗا",
    "translationText": "And those who give food in spite of love for it to the needy, the orphan, and the captive, [Saying], 'We feed you only for the countenance of Allah. We wish not from you reward or gratitude.'",
    "reference": "Al-Insan 76:8-9"
  }
]