[
  {
    "id": "10",
    "arabicText": "إِنَّمَا ٱلْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا۟ بَيْنَ أَخَوَيْكُمْ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُرْحَمُونَ",
    "translationText": "The believers are but brothers, so make settlement between your brothers. And fear Allah that you may receive mercy.",
    "reference": "Al-Hujurat 49:10"
  },
  {
    "id": "13",
    "arabicText": "وَٱلَّذِينَ جَٰهَدُوا۟ فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلْمُحْسِنِينَ",
    "translationText": "And those who strive for Us - We will surely guide them to Our ways. And indeed, Allah is with the doers of good.",
    "reference": "Al-Ankabut 29:69"
  },
  {
    "id": "103",
    "arabicText": "وَٱعْتَصِمُوا۟ بِحَبْلِ ٱللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا۟ ۚ وَٱذْكُرُوا۟ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَآءَ فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُمْ بِنِعْمَتِهِۦٓ إِخْوَٰنًا ۚ وَكُنتُمْ عَلَىٰ شَفَا حُفْرَةٍۢ مِّنَ ٱلنَّارِ فَأَنقَذَكُم مِّنْهَا ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمْ ءَايَٰتِهِۦ لَعَلَّكُمْ تَهْتَدُونَ",
    "translationText": "And hold firmly to the rope of Allah all together and do not become divided. And remember the favor of Allah upon you - when you were enemies and He brought your hearts together and you became, by His favor, brothers. And you were on the edge of a pit of the Fire, and He saved you from it. Thus does Allah make clear to you His verses that you may be guided.",
    "reference": "Al-Imran 3:103"
  },
  {
    "id": "104",
    "arabicText": "وَلْتَكُن مِّنكُمْ أُمَّةٌۭ يَدْعُونَ إِلَى ٱلۡخَيْرِ وَيَأمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۢهَوۡنَ عَنِ ٱلۡمُنكرِ وَأُو۟لَٰٓئِكَ هُمُ ٱلۡمُفلِحُونَ",
    "translationText": "And let there be [arising] from you a nation inviting to [all that is] good, enjoining what is right and forbidding what is wrong, and those will be the successful.",
    "reference": "Al-Imran 3:104"
  },
  {
    "id": "8",
    "arabicText": "وَٱلۡمُؤۡمِنُونَ وَٱلۡمُؤۡمِنَٰتُ بَعْضُهُمۡ أَوۡلِيَآءُ بَعْضٍۢ يَأمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۢهَوۡنَ عَنِ ٱلۡمُنكَرِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَيُطِيعُونَ ٱللَّهَ وَرَسُولَهُۥ ۚ أُو۟لَٰٓئِكَ سَيَرْحَمُهُمُ ٱللَّهُ ۗ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ",
    "translationText": "The believing men and believing women are allies of one another. They enjoin what is right and forbid what is wrong and establish prayer and give zakah and obey Allah and His Messenger. Those - Allah will have mercy upon them. Indeed, Allah is Exalted in Might and Wise.",
    "reference": "At-Tawbah 9:71"
  }
]